{{ config(
    materialized='table'
) }}

with
base as
(
    select * from {{ ref("exp_supplies_with_reserved") }}
),

filtred as
(
    select * from base
    where "Вид номенклат." in('Продукция','Товар')
    and "Склад" in (
        'Склад АгроСтальСтрой (ответхранение) брак',
        'Склад АгроСтальСтрой (ответхранение)',
        'Маркетплейс',
        'Витебск ГП', 
        'Витебск (пр-во) ГП3', 
        'Витебск (пр-во) ГП2', 
        'Витебск (пр-во) ГП', 
        'Витебск (пр-во) блокировка ГП', 
        'Склад ТЛЦ Орша-Белтаможсервис (ответхранение)')
),

defined_props_first as
(
    select 
    *
    ,CASE
        WHEN "Резерв?" = 0 AND "Качество" = 'СТОП(лаборатория)' AND "Склад" = 'Витебск ГП' THEN 'СТОП'
        WHEN "Резерв?" = 0 AND "Качество" = 'Новый' AND "Склад" = 'Витебск (пр-во) блокировка ГП' THEN 'СТОП'
        WHEN "Резерв?" = 0 AND "Качество" = 'Новый' AND "Склад" IN ('Витебск (пр-во) ГП', 'Витебск (пр-во) ГП1', 'Витебск (пр-во) ГП2', 'Витебск (пр-во) ГП3') THEN 'Неэтикеровано'
        WHEN "Резерв?" = 0 AND "Качество" = 'Новый' AND "Склад" = 'Склад ТЛЦ Орша-Белтаможсервис (ответхранение)' THEN 'ТЛЦ Орша (ответхранение)'
        WHEN "Резерв?" = 0 AND "Качество" = 'Выдержка' THEN 'Выдержка'
        WHEN "Резерв?" = 0 AND "Качество" = 'Новый' AND "Склад" LIKE 'Склад АгроСтальСтрой%' THEN CASE
            WHEN "Склад" LIKE '%брак' THEN 'РЦ Заславль (брак)'
            ELSE 'РЦ Заславль'
        END
        WHEN "Резерв?" = 0 AND "Качество" = 'Новый' THEN CASE
            WHEN "Склад" = 'Витебск ГП' THEN 'Для продажи Витебск'
            WHEN "Склад" = 'Маркетплейс' THEN 'Маркетплейс'
        END
        WHEN "Резерв?" = 1 THEN CASE
            WHEN "Склад" = 'Витебск ГП' THEN 'Резерв'
            WHEN "Склад" = 'Маркетплейс' THEN 'Резерв маркетплейс'
            WHEN "Склад" = 'Склад АгроСтальСтрой (ответхранение)' THEN 'Резерв Заславль'
        END
        ELSE 'не определенно'
    END AS "Комментарий"
    from filtred
),

defined_props_second as
(
    select 
    *
    ,CASE
        WHEN "Комментарий" = 'Выдержка' THEN 1
        ELSE 0
    END AS "Выдержка?"
    ,case 
        when "Комментарий"='Резерв' then "Количество, шт"
        else 0
    end as "В резерве"
    from defined_props_first 
),

defined_props_third as
(
    select 
    *
    ,CASE 
        WHEN ("Склад" = 'Витебск ГП' AND "Выдержка?" = 0) OR ("Склад" = 'РЦ Заславль' AND "Выдержка?" = 0) THEN
            CASE 
                WHEN "Комментарий" = 'Резерв' THEN "В резерве" * -1
                WHEN "Комментарий" <> 'Для продажи Витебск' THEN 0
                ELSE "Количество, шт"
            END
        ELSE 0
    END AS "Для продажи Витебск"
    ,CASE 
        WHEN "Комментарий" = 'СТОП' THEN "Количество, шт"
        ELSE 0
    END AS "СТОП"
    ,CASE 
        WHEN "Комментарий" = 'Для продажи Витебск' THEN "Количество, шт"
        ELSE 0
    END AS "Витебск ГП"
    ,CASE 
        WHEN "Комментарий" = 'Резерв Заславль' THEN "Количество, шт" * -1
        WHEN "Комментарий" = 'РЦ Заславль' THEN "Количество, шт"
        ELSE 0
    END AS "Для продажи Заславль"
    ,CASE 
        WHEN "Комментарий" = 'Резерв Болбасово' THEN "Количество, шт" * -1
        WHEN "Комментарий" = 'ТЛЦ Орша (ответхранение)' THEN "Количество, шт"
        ELSE 0
    END AS "ТЛЦ Орша (ответхранение)"
    ,CASE 
        WHEN "Комментарий" = 'Резерв Заславль' THEN "Количество, шт"
        ELSE 0
    END AS "Резерв Заславль"
    ,CASE 
        WHEN "Комментарий" = 'РЦ Заславль (брак)' THEN "Количество, шт"
        ELSE 0
    END AS "РЦ Заславль (брак)"
    ,CASE 
        WHEN "Комментарий" = 'РЦ Заславль (стоп)' THEN "Количество, шт"
        ELSE 0
    END AS "РЦ Заславль (стоп)"
    ,CASE 
        WHEN "Комментарий" = 'Резерв маркетплейс' THEN "Количество, шт" * -1
        WHEN "Комментарий" = 'Маркетплейс' THEN "Количество, шт"
        ELSE 0
    END AS "Маркетплейс"
    ,CASE 
        WHEN "Комментарий" = 'Резерв маркетплейс' THEN "Количество, шт"
        ELSE 0
    END AS "Резерв Маркетплейс"
    ,CASE 
        WHEN "Склад" = 'Неэтикеровано' THEN "Количество, шт"
        ELSE 0
    END AS "Неэтикеровано"
    ,CASE 
        WHEN "Выдержка?" = 1 AND "Дата окончания стопа серии ном."::date > CURRENT_DATE 
            THEN "Количество, шт" 
        ELSE 0 
    END AS "Витебск (пр-во) карантин",

    CASE 
        WHEN "Срок годности серии ном."::date = '0001-01-01'::date
            THEN '' 
        ELSE to_char("Срок годности серии ном.", 'YYYY-MM-DD') 
    END AS "Срок годности серии",

    CASE 
        WHEN "Дата производства серии ном."::date = '0001-01-01'::date
            THEN '' 
        ELSE to_char("Дата производства серии ном.", 'YYYY-MM-DD') 
    END AS "Дата производства",

    CASE 
        WHEN "Дата окончания стопа серии ном."::date = '0001-01-01'::date
            THEN '' 
        ELSE to_char("Дата окончания стопа серии ном.", 'YYYY-MM-DD') 
    END AS "Дата окончания выдержки",

    ("Срок годности серии ном." - "Дата производства серии ном.") AS "Срок годности, дн",

    CASE 
        WHEN "Срок годности серии ном."::date-"Дата"::date < 0 
            THEN 0 
        ELSE ("Срок годности серии ном."::date-"Дата"::date) 
    END AS "Срок реализации, дн"

    from defined_props_second
),

defined_props_fourth as
(
    select 
    *
    ,CASE 
        WHEN "Срок годности, дн" = 0 
            THEN 0 
        ELSE round(("Срок реализации, дн"::numeric / "Срок годности, дн"), 4)::real
    END AS "Срок реализации, %",

    CASE 
        WHEN "Резерв?" = '1' THEN 'Резерв'
        WHEN "Дата производства" = '' THEN '-'
        WHEN "Резерв?" = '0' AND "Дата производства" <> '' AND "Срок реализации, дн" <= 0 THEN 'Просрочено'
        WHEN round(("Срок реализации, дн"::numeric / "Срок годности, дн") * 100, 2) < 20 THEN '<20%'
        WHEN round(("Срок реализации, дн"::numeric / "Срок годности, дн") * 100, 2) BETWEEN 20 AND 49.99 THEN '<50%'
        WHEN round(("Срок реализации, дн"::numeric / "Срок годности, дн") * 100, 2) BETWEEN 50 AND 69.99 THEN '<70%'
        WHEN round(("Срок реализации, дн"::numeric / "Срок годности, дн") * 100, 2) BETWEEN 70 AND 79.99 THEN '70%-80%'
        WHEN round(("Срок реализации, дн"::numeric / "Срок годности, дн") * 100, 2) >= 80 THEN '>80%'
        ELSE '-' 
    END AS "Сроки"
    from defined_props_third
)

select * from defined_props_fourth