with
source as
(
    select * from {{ source('Stage1CUpp', 'РН_Продажи') }}
),

renamed_and_cast as
(
    select
	--"Активность",
	"НомерСтроки" as "Номер строки продаж",
	CAST("Регистратор" AS VARCHAR(70)) as "Регистратор продаж",
	"Период"::date as "Период продаж",
	CAST("Номенклатура" AS VARCHAR(70)) as "Номенклатура продаж",
	--"ХарактеристикаНоменклатуры" as "",
	CAST("ЗаказПокупателя" AS VARCHAR(70)) as "Заказ покупателя продаж",
	--"ДоговорКонтрагента" as "",
	"ДокументПродажи" as "Документ продаж",
	--"Подразделение" as "",
	--"Проект" as "",
	--"Организация" as "",
	"Контрагент" as "Контрагент продаж",
	--"КороткиеСроки" as "",
	"Количество"::real as "Количество продаж",
	"Стоимость"::real as "Стоимость продаж",
	--"СтоимостьБезСкидок" as "",
	"НДС"::real as "НДС продаж",
	--"ПараметрПериод" as "",
	"РегистраторГуид"::text,
	"НоменклатураГуид"::text,
	"ЗаказПокупателяГуид"::text,
	"ДоговорКонтрагентаГуид"::text,
	"ДокументПродажиГуид"::text,
	--"ПодразделениеГуид" as "",
	--"ПроектГуид" as "",
	--"ОрганизацияГуид" as "",
	"КонтрагентГуид"::text
	--"__Partition"
    from source
),

defined_props as 
(
    SELECT 
    *
    ,{{ dbt_utils.generate_surrogate_key(['\"РегистраторГуид\"', "\"Номер строки продаж\""]) }} as record_id
    --,now() as updated_at
    FROM renamed_and_cast
)

select * from defined_props