{{ config(
    materialized='view'
) }}

with source as (
select * from {{ source('Stage1CUpp', 'С_Склады') }}),

filtred as
(
    select * from source
    where "ЭтоГруппа" = FALSE
),

renamed as
(
    select
    --"Комментарий",
	"Подразделение" as "Подразделение склада",
	--"ВидСклада",
	--"НомерСекции",
	--"Адрес",
	--"Широта",
	--"Долгота",
	--"Контрагент",
	--"Договор",
	--"Предопределенный",
	--"Ссылка",
	--"ПометкаУдаления",
	--"ЭтоГруппа",
	--"Родитель",
	"Наименование" as "Наименование склада",
	--"Код",
	--"ПараметрНаименование",
	--"ПодразделениеГуид",
	--"КонтрагентГуид",
	--"ДоговорГуид",
	"СсылкаГуид"::text
	--"РодительГуид",
	--"__Partition"
    from filtred
)

select * from renamed