with
source as
(
    select * from {{ source('Stage1CUpp', 'РН_ПланыПроизводства') }}
),

renamed_and_cast as 
(
    select
    --"Активность",
	"НомерСтроки" as "Номер строки плана производ.",
	"Регистратор" as "Регистратор плана производ.",
	"Период"::date as "Период плана производ.",
	"Сценарий" as "Сценарий плана производ.",
	"Подразделение" as "Подразделение плана производ.",
	"Номенклатура" as "Номенклатура плана производ.",
	--"ХарактеристикаНоменклатуры",
	"ДокументПланирования"as "Документ плана производ.",
	--"Проект",
	--"Заказ",
	--"Контрагент",
	--"Договор",
	--"ВариантРаспределения",
	--"Спецификация",
	"Количество"::real as "Количество плана производ.",
	"Стоимость":: real as "Стоимость плана производ.",
	"НДС"::real as "НДС мес. плана производ.",
	--"ПараметрПериод",
	"РегистраторГуид"::text,
	--"СценарийГуид",
	--"ПодразделениеГуид",
	"НоменклатураГуид"::text
	--"ДокументПланированияГуид",
	--"ПроектГуид",
	--"ЗаказГуид",
	--"КонтрагентГуид",
	--"ДоговорГуид",
	--"СпецификацияГуид",
	--"__Partition"
    from source
),

defined_props as 
(
    SELECT 
    *
    ,{{ dbt_utils.generate_surrogate_key(['\"РегистраторГуид\"', "\"Номер строки плана производ.\""]) }} as record_id
    --,now() as updated_at
    FROM renamed_and_cast
)

select * from defined_props
