{{ config(
    materialized='view'
) }}

with 
defined_props as
(
    select
    {{star_exclude_guid(ref("exp_sales"), 
    additional_excludes=[
    "Количество продаж" 
    ,"Стоимость продаж" 
    ,"Номер строки продаж" 
    ,"Номер строки документа возврата"
    ,"Номер строки товара реализации"
    ,"key"
    ,"eur"
    ,"eur_scale"
    ,"usd"
    ,"usd_scale"
    ,"rub"
    ,"rub_scale"
    ])}}
    ,"Количество продаж" as "Количество, шт"
    ,"Стоимость продаж" as "Сумма продажи c НДС, BYN"
    ,"Стоимость продаж"-"НДС продаж" as "Сумма продажи без НДС, BYN"
    ,round(("Стоимость продаж"*eur/eur_scale)::numeric,2) as "Сумма продажи без НДС, EUR"
    ,round(("Стоимость продаж"*rub/rub_scale)::numeric,2) as "Сумма продажи без НДС, RUB"
    ,round(("Стоимость продаж"*usd/usd_scale)::numeric,2) as "Сумма продажи без НДС, USD"
    ,coalesce(
        "Серия номен товара реализации"
        ,"Серия номен документа возврата"
    ) as "Серия номенклатуры"
    ,coalesce(
        "Склад товара реализации"
        ,"Склад документа реализации"
        ,"Склад документа возврата"
    ) as "Склад"
    ,coalesce(
        "Код страны ISO контрагента"
        ,'BLR'
    ) as "Код страны контрагента"
            
    from
    {{ ref('exp_sales') }}
),

filtred as
(
    select * from defined_props
    where 
    "Вид номенклатуры" in ('Товар', 'Продукция')
	AND ("Регион контрагента" NOT IN ('Сотрудники', 'Матпомощь', 'Логистика'))
	and ("Регион торгового объекта" NOT IN ('Матпомощь', 'Сотрудники'))
	and ("Номенклатурная группа" not in ('Сырьё-товар', 'Сырьё и материалы', 'Упаковка', 'Упаковка-товар'))
	AND ("Склад" NOT IN ('Витебск ГП (опытные партии)'))
	AND ("Наименование торгового объекта" != 'ВПК Новка')
	AND ("Благ. помощь? документа реализации" = FALSE) 
)

select * from filtred