{{ config(
    materialized='table'
) }}

with
base as
(
    select * from {{ ref("int_supplies_with_reserved") }}
),

defined_props_1 as
(
    select 
    *
,CASE
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'СТОП(лаборатория)' AND "Склад остатков" = 'Витебск ГП' THEN 'СТОП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) блокировка ГП' THEN 'СТОП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП1' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП2' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП3' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Склад ТЛЦ Орша-Белтаможсервис (ответхранение)' THEN 'ТЛЦ Орша (ответхранение)'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск ГП' THEN 'Выдержка'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП' THEN 'Выдержка'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП1' THEN 'Выдержка'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП2' THEN 'Выдержка'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП3' THEN 'Выдержка'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Склад АгроСтальСтрой (ответхранение) брак' THEN 'РЦ Заславль (брак)'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Склад АгроСтальСтрой (ответхранение)' THEN 'РЦ Заславль'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск ГП' THEN 'Для продажи Витебск'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Маркетплейс' THEN 'Маркетплейс'
    WHEN "Резерв?" = 1 AND "Склад остатков" = 'Витебск ГП' THEN 'Резерв'
    WHEN "Резерв?" = 1 AND "Склад остатков" = 'Маркетплейс' THEN 'Резерв маркетплейс'
    WHEN "Резерв?" = 1 AND "Склад остатков" = 'Склад АгроСтальСтрой (ответхранение)' THEN 'Резерв Заславль'
    ELSE 'не определенно'
END AS "Комментарий",

CASE
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'СТОП(лаборатория)' AND "Склад остатков" = 'Витебск ГП' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'СТОП(лаборатория)' AND "Склад остатков" = 'Склад АгроСтальСтрой (ответхранение)' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) блокировка ГП' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП1' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП2' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск (пр-во) ГП3' THEN 'Неэтикеровано'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Склад ТЛЦ Орша-Белтаможсервис (ответхранение)' THEN 'ТЛЦ Орша (ответхранение)'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск ГП' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП1' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП2' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Выдержка' AND "Склад остатков" = 'Витебск (пр-во) ГП3' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Склад АгроСтальСтрой (ответхранение) брак' THEN 'РЦ Заславль'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Склад АгроСтальСтрой (ответхранение)' THEN 'РЦ Заславль'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Витебск ГП' THEN 'Витебск ГП'
    WHEN "Резерв?" = 0 AND "Качество остатков" = 'Новый' AND "Склад остатков" = 'Маркетплейс' THEN 'Маркетплейс'
    WHEN "Резерв?" = 1 THEN 'Витебск ГП'
    ELSE 'не определенно'
END AS "Склад"
from base
---------------------------------------------------------------------------------------------
),

defined_props_2 as
(
    select 
    *
    ,CASE
        WHEN "Комментарий" = 'Выдержка' THEN 1
        ELSE 0
    END AS "Выдержка?"
    from defined_props_1
),

defined_props_3 as
(
    select 
    *
    ,CASE 
    WHEN "Комментарий" = 'Резерв' THEN "Количество, шт"
    ELSE 0
END AS "В резерве"
from defined_props_2
),

defined_props_4 as
(
    select
    *,
CASE
    WHEN (("Склад" = 'Витебск ГП' AND "Выдержка?" = 0) OR ("Склад" = 'РЦ Заславль' AND "Выдержка?" = 0)) THEN 
        CASE 
            WHEN "Комментарий" = 'Резерв' THEN "В резерве" * -1
            WHEN "Комментарий" <> 'Для продажи Витебск' THEN 0
            ELSE "Количество, шт"
        END
    ELSE 0
END AS "Для продажи Витебск",

CASE 
    WHEN "Комментарий" = 'СТОП' THEN "Количество, шт"
    ELSE 0
END AS "СТОП",

CASE 
    WHEN "Комментарий" = 'Для продажи Витебск' THEN "Количество, шт"
    ELSE 0
END AS "Витебск ГП",

CASE
    WHEN "Комментарий" = 'Резерв Заславль' THEN "Количество, шт" * -1
    WHEN "Комментарий" = 'РЦ Заславль' THEN "Количество, шт"
    ELSE 0
END AS "Для продажи Заславль",

CASE
    WHEN "Комментарий" = 'Резерв Болбасово' THEN "Количество, шт" * -1
    WHEN "Комментарий" = 'ТЛЦ Орша (ответхранение)' THEN "Количество, шт"
    ELSE 0
END AS "ТЛЦ Орша (ответхранение)",

CASE 
    WHEN "Комментарий" = 'Резерв Заславль' THEN "Количество, шт"
    ELSE 0
END AS "Резерв Заславль",

CASE 
    WHEN "Комментарий" = 'РЦ Заславль (брак)' THEN "Количество, шт"
    ELSE 0
END AS "РЦ Заславль (брак)",

CASE 
    WHEN "Комментарий" = 'РЦ Заславль (стоп)' THEN "Количество, шт"
    ELSE 0
END AS "РЦ Заславль (стоп)",

CASE
    WHEN "Комментарий" = 'Резерв маркетплейс' THEN "Количество, шт" * -1
    WHEN "Комментарий" = 'Маркетплейс' THEN "Количество, шт"
    ELSE 0
END AS "Маркетплейс",

CASE 
    WHEN "Комментарий" = 'Резерв маркетплейс' THEN "Количество, шт"
    ELSE 0
END AS "Резерв Маркетплейс",

CASE 
    WHEN "Склад" = 'Неэтикеровано' THEN "Количество, шт"
    ELSE 0
END AS "Неэтикеровано"
from defined_props_3
)

select * from defined_props_4