{{ config(
    materialized='table'
) }}

with source as (
select * from {{ source('Stage1CUpp', 'РС_ЦеныНоменклатуры') }}),

renamed_and_cast as
(
    select
   -- "Активность",
	"НомерСтроки" as "Номер строки уст. цен",
	"Регистратор" as "Документ уст. цен",
	"Период"::date as "Период уст. цен",
	"ТипЦен" as "Тип цен уст. цен",
	"Номенклатура" as "Нолменклатура уст. цен",
	--"ХарактеристикаНоменклатуры",
	"Валюта" as "Валюта уст. цен",
	"Цена"::real as "Цена уст. цен",
	--"ЕдиницаИзмерения",
	"ПроцентСкидкиНаценки" as "Процент скидки наценки уст. цен", 
	--"СпособРасчетаЦены",
	"Прейскурант" as "Прейскуратн уст. цен",
	--"ПараметрПериод",
	"РегистраторГуид"::text,
	"ТипЦенГуид"::text,
	"НоменклатураГуид"::text
	--"ВалютаГуид",
	--"ЕдиницаИзмеренияГуид",
	--"__Partition"
    from source
),

defined_props as 
(
    SELECT
    *
    ,{{ dbt_utils.generate_surrogate_key([
        '\"РегистраторГуид\"',
        '\"Номер строки уст. цен\"'
    ])}} as record_id
    from renamed_and_cast
)


select * from defined_props