{{
    config(
        materialized='incremental'
    )
}}

SELECT
	`НомерСтроки`,
	`Регистратор`,
	`Период`,
	`Номенклатура`,
	`ЗаказПокупателя`,
	`ДоговорКонтрагента`,
	`ДокументПродажи`,
	`Контрагент`,
	`КороткиеСроки`,
	`Количество`,
	`Стоимость`,
	`СтоимостьБезСкидок`,
	`НДС`,
	`РегистраторГуид`,
	`НоменклатураГуид`,
	`ЗаказПокупателяГуид`,
	`ДоговорКонтрагентаГуид`,
	`ДокументПродажиГуид`,
	`КонтрагентГуид`,
now() as updated_at FROM {{ source('Stage1CUpp', 'РН_Продажи') }}

{% if is_incremental() %}
  where "Период" >= dateAdd(month, -1, today())
{% endif %}
