{{
    config(
        materialized='incremental'
    )
}}

SELECT
	`Активность`,
	`НомерСтроки`,
	`Регистратор`,
	`Период`,
	`Номенклатура`,
	`ХарактеристикаНоменклатуры`,
	`ЗаказПокупателя`,
	`ДоговорКонтрагента`,
	`ДокументПродажи`,
	`Подразделение`,
	`Проект`,
	`Организация`,
	`Контрагент`,
	`КороткиеСроки`,
	`Количество`,
	`Стоимость`,
	`СтоимостьБезСкидок`,
	`НДС`,
	`ПараметрПериод`,
	`РегистраторГуид`,
	`НоменклатураГуид`,
	`ЗаказПокупателяГуид`,
	`ДоговорКонтрагентаГуид`,
	`ДокументПродажиГуид`,
	`ПодразделениеГуид`,
	`ПроектГуид`,
	`ОрганизацияГуид`,
	`КонтрагентГуид`,
	`__Partition`,
now() as updated_at FROM {{ ref('stg_РН_Продажи') }}

{% if is_incremental() %}
  where "Период" >= dateAdd(month, -2, today())
{% endif %}
