{{
    config(
        materialized='view'
    )
}}

with
source as 
(
	SELECT * from {{ ref("stg_РН_ПланыПроизводства") }}
),

filtred as
(
	SELECT * from source 
	where "Сценарий" = 'Ежемесячный'
	and "Номенклатура" not like '%далить%'
),

renamed as
(
SELECT
	--"Активность",
	--"НомерСтроки",
	--"Регистратор",
	"Период" as "Период мес. плана производ.",
	--"Сценарий",
	"Подразделение" as "Подразделение мес. плана производ.",
	"Номенклатура" as "Номенклатура мес. плана производ.",
	--"ХарактеристикаНоменклатуры",
	"ДокументПланирования" as "Документ мес. плана производ.",
	--"Проект",
	--"Заказ",
	--"Контрагент",
	--"Договор",
	--"ВариантРаспределения",
	--"Спецификация" as "Спецификация мес. плана производ.",
	"Количество" as "Количество мес. плана производ.",
	"Стоимость" as "Стоимость мес. плана производ.",
	"НДС" as "НДС мес. плана производ.",
	--"ПараметрПериод",
	--"РегистраторГуид",
	"СценарийГуид",
	"ПодразделениеГуид",
	"НоменклатураГуид",
	"ДокументПланированияГуид",
	"ПроектГуид",
	"ЗаказГуид",
	"КонтрагентГуид",
	"ДоговорГуид",
	"СпецификацияГуид",
	key_record
	--"__Partition"
	from filtred
)

SELECT * from renamed
