{{
    config(
        materialized='view'
    )
}}

with 
base as 
(
select
	"Склад",
	"Номенклатура",
	"ДокументРезерва",
	key_record,
	"СкладГуид",
	"НоменклатураГуид",
	"ДокументРезерваГуид",
	"ДатаОстатка",
	updated_at,
	"КоличествоОстаток"
    from 
    {{ ref("stg_РН_ТоварыВРезНаСкладОстат") }}
),

renamed as(
    select
    "Склад" as "Склад рез. остатков",
	"Номенклатура" as "Номенклатура рез. остатков",
	"ДокументРезерва" as "Документ рез. остатков",
	key_record,
	"СкладГуид",
	"НоменклатураГуид",
	"ДокументРезерваГуид",
	"ДатаОстатка" as "Дата рез. остатков",
	updated_at,
	"КоличествоОстаток" as "Количество рез. остатков"
    from base
)

select * from renamed