{{
    config(
        materialized='table'
    )
}}

SELECT
	"НомерСтроки" as "Номер строки продаж",
	"Регистратор" as "Документ продаж",
	"Период" as "Период продаж",
	"Номенклатура" as "Номенклатура продаж",
	"ЗаказПокупателя" as "Заказ покупателя продаж",
	--"ДоговорКонтрагента",
	"ДокументПродажи" as "Документ продажи",
	"Контрагент" as "Контрагент продаж",
	--"КороткиеСроки",
	"Количество" as "Количество продаж",
	"Стоимость" as "Стоимость продаж",
	--"СтоимостьБезСкидок",
	"НДС" as "НДС продаж",
	"РегистраторГуид",
	"НоменклатураГуид",
	"ЗаказПокупателяГуид",
	--"ДоговорКонтрагентаГуид",
	"ДокументПродажиГуид",
	"КонтрагентГуид",
	key_record
	FROM {{ ref("stg_РН_Продажи") }}
